"""
ZAP[1]=ZAP[0]
x=random()
r1={"N":0,"TJOB":0}
model(r1)
print("N=",r1["N"],"TJOB=",r1["TJOB"])"""

def expexcel(ADP,ADK,ZAP):
    import xlwt
    # Создаем книгу
    book = xlwt.Workbook('utf8')
    # Создаем шрифт
    font = xlwt.easyxf('font: height 200,name Arial,colour_index black, bold off,\
        italic off; align: wrap on, vert top, horiz left;\
        pattern: pattern solid, fore_colour white;')  # yellow gray25
    # Добавляем лист
    sheet = book.add_sheet('sheetname')
    # Лист в положении "альбом"
    sheet.portrait = False
    # Масштабирование при печати
    sheet.set_print_scaling(85)
    # Высота строки
    for i in range(31):
        sheet.row(i).height = 2500
    # Ширина колонки
    for i in range(13):
        sheet.col(i).width = 3000
    szap=(1,0) # кооодинаты ZAP
    # Массив комментариев
    CMT=[{"ТЕКСТ":"Опт. парам.","КООРД":[(0,0)]},
         {"ТЕКСТ": "Экспер.", "КООРД": [(4, 0)]},
         {"ТЕКСТ": "Натур.", "КООРД": [(8,1),(8,5),(8,9),(21,1),(21,5),(21,9)]},
         {"ТЕКСТ": "Модель", "КООРД": [(8,2),(8,6),(8,10),(21,2),(21,6),(21,10)]},
         {"ТЕКСТ": "Отн. ош. %","КООРД": [(8,3),(8,7),(8,11),(21,3),(21,7),(21,11)]},
         {"ТЕКСТ": "Адапт.","КООРД": [(8,4),(8,8),(8,12),(21,4),(21,8),(21,12)]},
         {"ТЕКСТ": "s","КООРД": [(5,0),(18,0)]},
         {"ТЕКСТ": "N","КООРД": [(8,0),(21,0)]},
         {"ТЕКСТ": "Q","КООРД": [(7,1),(7,5),(7,9),(20,1),(20,5),(20,9),]}]
    # Массив значений N,Q,s для комментариев и проверки
    NQR=[{"ТИП":"N", "ЗНАЧ":3,"СМЕЩ":0, "КООРД": [(9,0),(22,0)]},
         {"ТИП":"N", "ЗНАЧ":6,"СМЕЩ":1, "КООРД": [(10,0),(23,0)]},
         {"ТИП":"N", "ЗНАЧ":9,"СМЕЩ":2, "КООРД": [(11,0),(24,0)]},
         {"ТИП":"Q", "ЗНАЧ":10000000,"СМЕЩ":None, "КООРД": [(7,2),(20,2)]},
         {"ТИП":"Q", "ЗНАЧ":20000000,"СМЕЩ":None, "КООРД": [(7,6),(20,6)]},
         {"ТИП":"Q", "ЗНАЧ":30000000,"СМЕЩ":None, "КООРД": [(7,10),(20,10)]},
         {"ТИП":"s", "ЗНАЧ":2,"СМЕЩ":None, "КООРД": [(5,1)]},
         {"ТИП":"s", "ЗНАЧ":4,"СМЕЩ":None, "КООРД": [(18,1)]}]
    # Массив координат матриц с результатами по (Q,s)
    QRS=[{"Q":10000000, "s":2, "КООРД": [(9,1)]},
         {"Q":20000000, "s":2, "КООРД": [(9,5)]},
         {"Q":30000000, "s":2, "КООРД": [(9,9)]},
         {"Q":10000000, "s":4, "КООРД": [(22, 1)]},
         {"Q":20000000, "s":4, "КООРД": [(22, 5)]},
         {"Q":30000000, "s":4, "КООРД": [(22, 9)]}]

    # Выводим заголовки
    for i in range(len(CMT)):
        for j in range(len(CMT[i]["КООРД"])):
            sheet.write(CMT[i]["КООРД"][j][0],CMT[i]["КООРД"][j][1],CMT[i]["ТЕКСТ"],font)
    # Выводим значения N,Q,s для комментариев
    for i in range(len(NQR)):
        for j in range(len(NQR[i]["КООРД"])):
            sheet.write(NQR[i]["КООРД"][j][0],NQR[i]["КООРД"][j][1],NQR[i]["ЗНАЧ"],font)
    # Выводим ZAP
    s=szap[0]; c=szap[1] # координаты матрицы
    for i in range(len(ZAP[0])):
        sheet.write(s,c+i,ZAP[3][i],font)
        sheet.write(s+1,c+i,ZAP[2][i],font)
    # Выводим результаты: J1=0 -по рез. адаптации, J1=1 - по рез. оценки адекватности
    for J1 in range(2):
        if J1==0:
            AD1=ADP
        else:
            AD1 = ADK
        for i in range(len(AD1)):
            n1=AD1[i]["N"]
            # поиск N в NQR
            for j in range(len(NQR)):
                if NQR[j]["ТИП"]=="N" and n1==NQR[j]["ЗНАЧ"]:
                    smn1=NQR[j]["СМЕЩ"] # N найден
                    break
            else:
                print("N НЕ НАЙДЕН, N=",n1)
                continue
            # поиск (Q,s) в QRS
            for j in range(len(QRS)):
                if QRS[j]["Q"]==AD1[i]["Q"] and QRS[j]["s"]==AD1[i]["s"]:
                    s=QRS[j]["КООРД"][0][0] # (Q,s) найден, чтение коордираты матрицы
                    c=QRS[j]["КООРД"][0][1]
                    break
            else:
                print("(Q,R) НЕ НАЙДЕНЫ, (Q,s)=",AD1[i]["Q"],AD1[i]["s"])
                continue
            # Выводим результат
            sheet.write(s+smn1,c, AD1[i]["ТЭКС"], font)
            sheet.write(s+smn1,c+1, AD1[i]["ТМОПТ"], font)
            sheet.write(s+smn1,c+2, AD1[i]["ОТОШ"], font)
            if J1==0:
                sheet.write(s + smn1, c + 3, "+", font)

    #pr=[{"P":"текст", "КООР":[(2,3),(12,13)]}]
    #x= pr[0]["КООР"][0][1]
    # Заполняем ящейку (Строка, Колонка, Текст, Шрифт)
    #sheet.write(0,0,a,font)
    #sheet.write(0,1,30,font)

    # Сохраняем в файл
    book.save('/home/maydar/python_projects/MPM_PDP-2017/results.xls')
    return 0